config.org
#+TITLE: apple's GNU Emacs Config
#+AUTHOR: apple115
#+auto_tangle:t
#+STARTUP: overview

* early-init.el
:PROPERTIES:
:HEADER-ARGS: :tangle early-init.el
:END:
在Emacs刚启动，还未加载主要配置文件时的配置文件。
#+BEGIN_SRC emacs-lisp
;;; early-init.el --- Emacs pre-initialization config -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

;; 设置垃圾回收参数
(setq gc-cons-threshold most-positive-fixnum)
(setq gc-cons-percentage 0.6)
;; reduce the frequency of garbage collection by making it happen on
;; each 50MB of allocated data (the default is on every 0.76MB)
(setq gc-cons-threshold 80000000) ;; original value * 100
(setq read-process-output-max (* 1024 1024)) ;; 1mb

;; 启动早期不加载`package.el'包管理器
(setq package-enable-at-startup nil)
;; 不从包缓存中加载
(setq package-quickstart nil)

;; 禁止展示菜单栏、工具栏和纵向滚动条
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

;; 禁止自动缩放窗口先
(setq frame-inhibit-implied-resize t)

;; 禁止菜单栏、工具栏、滚动条模式，禁止启动屏幕和文件对话框
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-splash-screen t)
(setq use-file-dialog nil)

;; 在这个阶段不编译
(setq inhibit-automatic-native-compilation t)

(provide 'early-init)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; early-init.el ends here
#+END_SRC

* init.el
:PROPERTIES:
:HEADER-ARGS: :tangle init.el
:END:
=init.el= 是emacs的主要配置文件
** init.el 文件头
#+begin_src emacs-lisp
;;; init.el --- The main init entry for Emacs -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

#+END_SRC
** package 包管理器
#+begin_src emacs-lisp
(require 'package)
(setq package-archives
  '(("melpa"  . "https://melpa.org/packages/")
	("gnu"    . "https://elpa.gnu.org/packages/")
	("nongnu" . "https://elpa.nongnu.org/nongnu/")))
(package-initialize)


#+end_src
** 加模块化配
#+BEGIN_SRC emacs-lisp
;; 将lisp目录放到加载路径的前面以加快启动速度
(let ((dir (locate-user-emacs-file "lisp")))
  (add-to-list 'load-path (file-name-as-directory dir)))

;; 加载各模块化配置
;; 不要在`*message*'缓冲区显示加载模块化配置的信息
(with-temp-message ""
 (require 'init-tools)
 (require 'init-ui)                    ; 加载UI交互的模块化配置文件
 (require 'init-completion) ; 加载完成的模块文件

 (require 'init-org)
 (require 'init-org-set)
 (require 'init-org-capture)
 (require 'init-org-agenda)

 (require 'init-langs)
 (require 'init-edit)
 (require 'init-flyspell)
;; (require 'init-mind-wave)
;;( require 'init-centaur-tabs)
 (require 'init-rime)
;; (require 'init-aweshell)
 (require 'init-hexo)
 (require 'init-auto-yas)
;; (require 'init-sort-tab)
;;(require 'init-tabspaces)

 (require 'init-vertico)
 (require 'init-consult)
 (require 'init-embark)
 (require 'init-marginalia)
 (require 'init-orderless)
 (require 'init-shackle)
;; (require 'init-dashboard)

(require 'init-consult-notes)
(require 'init-vterm)
;;(require 'init-smart-input-source)
;; (require 'init-awesome-tray)
(require 'init-magit)
(require 'init-realgud)
(require 'init-colorful-mode)
(require 'init-devdocs)
(require 'init-bufler)
(require 'init-dired)
(require 'init-doom-modeline)
(require 'init-org-reveal)
(require 'init-gptel)
 ;;(require 'init-eaf)
;; (require 'init-js2)
  )
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
#+END_SRC
** init.el 文件尾
#+BEGIN_SRC emacs-lisp

(provide 'init)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init.el ends here
#+END_SRC

* init-edit.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-edit.el :mkdirp yes
:END:
** init-edit.el 文件头

#+BEGIN_SRC emacs-lisp
;;; init-edit.el --- Editing settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

#+END_SRC
**

** myfunc
#+begin_src emacs-lisp

(defun my-load-config ()
"Load Emacs configuration."
(interactive)
(load-file "~/.config/emacs/init.el"))

(defun my-open-termial-kitty ()
"open kitty terminal in load filepath"
(interactive)
(let ((directory (eshell/pwd)))
(async-shell-command (format "kitty --directory %s" directory))
))

(defun open-vterm-in-other-window ()
  "Open a vterm in a new window."
  (interactive)
  (split-window-right)
  (other-window 1)
  (multi-vterm)
)

#+end_src

** evil
#+begin_src emacs-lisp
(use-package evil
    :ensure t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (evil-mode 1)
)

(use-package evil-collection
:ensure t
:after evil
:config
(setq evil-collection-mode-list '(ibuffer calendar vterm eshell magit realgud bufler))
(evil-collection-init))

(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))

(use-package evil-nerd-commenter
  :ensure t
  :init
  (define-key evil-normal-state-map (kbd "gcc") 'evilnc-comment-or-uncomment-lines)
  (define-key evil-visual-state-map (kbd "gcc") 'evilnc-comment-or-uncomment-lines)
)

(setq x-select-request-type nil)


#+end_src
** avy
#+begin_src emacs-lisp
  (use-package avy
   :ensure t)
#+end_src
** sudo-edit
#+begin_src emacs-lisp
(use-package sudo-edit
  :ensure t
)
#+end_src
** saveplace 记住光标的位置
#+begin_src emacs-lisp
(use-package saveplace
  :ensure nil
  :hook (after-init . save-place-mode))
#+end_src
** so-long
#+begin_src emacs-lisp
(use-package so-long
  :ensure nil
  :config (global-so-long-mode 1))
#+end_src
** smart-input-sourc
##+begin_src emacs-lisp
(use-package sis
  ;; :hook
  ;; enable the /context/ and /inline region/ mode for specific buffers
  ;; (((text-mode prog-mode) . sis-context-mode)
  ;;  ((text-mode prog-mode) . sis-inline-mode))
  :ensure t
  :config


  (sis-ism-lazyman-config "1" "2" 'fcitx5)
  ;; enable the /cursor color/ mode
  ;;(sis-global-cursor-color-mode t)
  ;; enable the /respect/ mode
  ;;(sis-global-respect-mode t)
  ;; enable the /context/ mode for all buffers
  ;;(sis-global-context-mode t)
  ;; enable the /inline english/ mode for all buffers
  ;;(sis-global-inline-mode t)
  )

##+end_src
** 括号补全
#+begin_src emacs-lisp
(use-package elec-pair
  :ensure nil
  :hook (after-init . electric-pair-mode)
  :init (setq electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit))
#+end_src

** general
#+begin_src emacs-lisp
(use-package general
  :ensure t
  :config
  (general-evil-setup)

  ;; set up 'SPC' as the global leader key
  (general-create-definer dt/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode


  (dt/leader-keys
   "SPC" '(bufler-switch-buffer :wk "bufler")
   )

  (dt/leader-keys
   "." '(find-file :wk "find file")
   "g"'(:ignore t :wk "goto")
   "g c" '((lambda () (interactive) (find-file "~/.emacs.d")) :wk "Edit emacs config")
   "g s" '((lambda () (interactive) (find-file "~/.emacs.d/snippets")) :wk "Edit emacs snippet")
   "g b" '((lambda () (interactive) (find-file "~/blog")) :wk "blog")
   )

  (dt/leader-keys
    "f" '(:ignore t :wk "Find")
    "f f" '(consult-fd :wk "find file")
    "f w" '(consult-ripgrep :wk "find word")
    "f m" '(consult-man :wk "find man")
    "f n" '(consult-notes :wk "find notes")
    "f u" '(sudo-edit-find-file :wk "Sudo find file")
    "f U" '(sudo-edit :wk "Sudo edit file")
  )


  (dt/leader-keys
    "b" '(:ignore t :wk "buffer")
    "b b" '(consult-buffer :wk "Switch buffer")
    "b k" '(kill-buffer :wk "kill buffer")
    "b i" '(bufler :wk "Ibuffer")
    "b r" '(revert-buffer :wk "Reload buffer")
   )

  (dt/leader-keys
    "e" '(:ignore t :wk "Evaluate")
    "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
    "e d" '(eval-defun :wk "Evaluate defun containing or after point")
    "e e" '(eval-expression :wk "Evaluate and elisp expression")
    "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
    "e r" '(eval-region :wk "Evaluate elisp in region"))






   (dt/leader-keys
    "h" '(:ignore t :wk "Help")
    "h f" '(describe-function :wk "Describe function")
    "h v" '(describe-variable :wk "Describe variable")
    "h r r" '(my-load-config :wk "Reload Emacs config")
)

   (dt/leader-keys
    "5" '(projectile-run-project :wk "run project")
    "6" '(projectile-test-project :wk "test project")
    "9" '(projectile-compile-project :wk "compile project")
    "=" '((lambda () (interactive) (format-all-buffer)) :wk "current buffer format")
)

   (dt/leader-keys
    "t" '(:ignore t :wk "Toggle")
    "t t" '(my-open-termial-kitty :wk "open terminal")
   )

   (dt/leader-keys
    "o" '(:ignore t :wk "open")
    "o o" '(embark-act :wk "embark-act")
    "o t" '(vterm-toggle-insert-cd :wk "open terminal")
    "o s" '(async-shell-command :wk "open async shell command")
    "o c" '((lambda () (interactive) (org-capture)) :wk "open org-capture")
    "o a" '((lambda () (interactive) (org-agenda)) :wk "open org-agenda"))

   (dt/leader-keys
    "x" '(:ignore t :wk "fix")
    "x x" '(lsp-bridge-diagnostic-list :wk "show diagnostic list")
    "x c" '(lsp-bridge-diagnostic-copy :wk "copy diagnostic list"))

   (dt/leader-keys
    "p" '(:ignore t :wk "project")
    "p p" '(projectile-switch-project :wk "project switch project")
    "p f" '(projectile-find-file :wk "project find file")
    "p d" '(projectile-dired :wk "project dired")
    "p b" '(projectile-switch-to-buffer :wk "project switch buffer"))

   (dt/leader-keys
    "d" '(:ignore t :wk "denote")
    "d n" '(denote :wk "create denote")
    "d d" '(denote-date :wk "create date note")
    "d t" '(denote-type :wk "creates a note while prompting for a file type")
    "d s" '(denote-subdirectory :wk "create note ")
    "d f" '(denote-open-or-create :wk "find denote")
    "d r" '(denote-dired-rename-file :wk "rename denote"))


)

#+end_src
** keymap
#+begin_src emacs-lisp

(global-unset-key (kbd "C-SPC"))
(global-set-key (kbd "C-x 4 t") 'open-vterm-in-other-window)

  (evil-define-key 'normal global-map (kbd "C-.") 'popper-toggle)
  (evil-define-key 'normal global-map (kbd "M-.") 'popper-cycle)

  (evil-define-key 'normal global-map (kbd "m") 'consult-register-store)
  (evil-define-key 'normal global-map (kbd "'") 'consult-register-load)

  (evil-define-key 'insert global-map (kbd "C-.") 'popper-toggle)
  (evil-define-key 'insert global-map (kbd "M-.") 'popper-cycle)

;; 定义快捷键在 rust-mode 下生效
(with-eval-after-load 'prog-mode
  (evil-define-key 'normal prog-mode-map (kbd "K") 'lsp-bridge-show-documentation)
  (evil-define-key 'normal prog-mode-map (kbd "gd") 'lsp-bridge-find-def)
  (evil-define-key 'normal prog-mode-map (kbd "gi") 'lsp-bridge-find-imp)
  (evil-define-key 'normal prog-mode-map (kbd "go") 'lsp-bridge-find-def-return)
)

(with-eval-after-load 'rust-mode
)

;; 定义快捷键在 python-mode 下生效
(with-eval-after-load 'python-mode
)


(general-define-key
 :states '(normal visual)
 :keymaps 'org-mode-map
 :prefix "SPC"
  "c" '(:ignore t :wk "mode define command")
  "c c" '(org-toggle-checkbox  :wk"toggle-checkbox")
)

(general-define-key
 :states '(normal visual)
 :keymaps 'override
 :prefix "SPC"
  "c" '(:ignore t :wk "mode define command")
  "c o" '(xah-open-in-external-app :wk"open the file with xopen")
  "c p" '(my-paste-to-dired  :wk "past some in the dired")
)

;; 可以继续为其他模式添加类似的代码

(evil-collection-define-key 'insert 'lsp-bridge-mode-map (kbd "C-n") #'acm-select-next)
(evil-collection-define-key 'insert 'lsp-bridge-mode-map (kbd "C-p") #'acm-select-prev)

;; agenda

(add-hook 'org-agenda-mode-hook
          (lambda ()
            (evil-set-initial-state 'org-agenda-mode 'normal)))
  (evil-define-key 'normal org-agenda-mode-map (kbd "q") 'org-agenda-quit)


  (evil-define-key 'normal org-agenda-mode-map (kbd "j") 'org-agenda-next-line)
  (evil-define-key 'normal org-agenda-mode-map (kbd "k") 'org-agenda-previous-line)


  (evil-define-key 'normal org-agenda-mode-map (kbd "<tab>") 'org-agenda-todo)
  (evil-define-key 'normal org-agenda-mode-map (kbd "gc") 'org-agenda-goto-calender)
  (evil-define-key 'normal org-agenda-mode-map (kbd "gr") 'org-agenda-redo)

  (evil-define-key 'normal org-agenda-mode-map (kbd "u") 'org-agenda-undo)

;; capture
(add-hook 'org-capture-mode-hook
          (lambda ()
            (evil-set-initial-state 'org-capture-mode 'normal)))

;; vim keymap setting
  (evil-define-key  'normal prog-mode-map (kbd "s") 'avy-goto-char-2)
  (evil-define-key  'normal text-mode-map (kbd "s") 'avy-goto-char-2)

  (evil-define-key  'insert prog-mode-map (kbd "C-y") 'yas-expand)
  (evil-define-key  'insert text-mode-map (kbd "C-y") 'yas-expand)

  (evil-define-key 'normal org-mode-map (kbd "<tab>") 'org-cycle)

  (evil-define-key 'normal global-map (kbd "H") 'evil-beginning-of-line)
  (evil-define-key 'normal global-map (kbd "L") 'evil-end-of-line)
  (evil-define-key 'visual global-map (kbd "H") 'evil-beginning-of-line)
  (evil-define-key 'visual global-map (kbd "L") 'evil-end-of-line)


#+end_src

** init-edit.el 文件尾

#+BEGIN_SRC emacs-lisp
;; (message "init-base configuration: %.2fs"
;;          (float-time (time-subtract (current-time) my/init-base-start-time)))

(provide 'init-edit)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-edit.el ends here
#+END_SRC

* init-ui.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-ui.el :mkdirp yes
:END:
** init-ui.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-ui.el --- UI settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

#+END_SRC

** gruvbox 主题
#+begin_src emacs-lisp
(load-theme 'gruvbox-light-soft t)
#+end_src
** 字体设置
#+begin_src emacs-lisp

(defun my-apply-font()
(set-face-attribute 'default nil :font (font-spec :family "Inconsolata" :size 18 :weight 'bold))
 ;; (set-fontset-font t 'unicode (font-spec :family "Noto Color Emoji" :size 14))
(set-fontset-font t '(#x2ff0 . #x9ffc) (font-spec :family "LXGW WenKai" :size 18 :weight 'bold))
)
(my-apply-font)
(add-hook 'after-make-frame-functions
          (lambda (frame)
            (select-frame frame)
            (my-apply-font)))
;;测试一下这个

#+end_src
#+CAPTION: 测试中英文字体对齐
#+NAME: 测试中英文字体对齐
|中文|
|abcd|

