config.org
** 其他UI设置
#+begin_src emacs-lisp
 ;; 禁用一些GUI特性
 (setq use-dialog-box nil)               ; 鼠标操作不使用对话框
 (setq inhibit-default-init t)           ; 不加载 `default' 库
 (setq inhibit-startup-screen t)         ; 不加载启动画面
 (setq inhibit-startup-message t)        ; 不加载启动消息
 (setq inhibit-startup-buffer-menu t)    ; 不显示缓冲区列表

 ;; 草稿缓冲区默认文字设置
 (setq initial-scratch-message (concat ";; Happy hacking, "
                                       (capitalize user-login-name) " - Emacs ♥ you!\n\n"))

 ;; 设置缓冲区的文字无
  (setq-default bidi-display-reordering nil)
   (setq bidi-inhibit-bpa t
      long-line-threshold 1000
      large-hscroll-threshold 1000
      syntax-wholeline-max 1000)
 ;; 禁止使用双向括号算法
 ;; (setq bidi-inhibit-bpa t)

 ;; 设置自动折行宽度为80个字符，默认值为70
 (setq-default fill-column 80)

 ;; 设置大文件阈值为100MB，默认10MB
 (setq large-file-warning-threshold 100000000)

 ;; 以16进制显示字节数
 (setq display-raw-bytes-as-hex t)
 ;; 有输入时禁止 `fontification' 相关的函数钩子，能让滚动更顺滑
 (setq redisplay-skip-fontification-on-input t)

 ;; 禁止响铃
 (setq ring-bell-function 'ignore)

 ;; 禁止闪烁光标
 (blink-cursor-mode -1)

 ;; 在光标处而非鼠标所在位置粘贴
 (setq mouse-yank-at-point t)

 ;; 拷贝粘贴设置
 (setq select-enable-primary nil)        ; 选择文字时不拷贝
 (setq select-enable-clipboard t)        ; 拷贝时使用剪贴板

 ;; 鼠标滚动设置
 (setq scroll-step 2)
 (setq scroll-margin 2)
 (setq hscroll-step 2)
 (setq hscroll-margin 2)
 (setq scroll-conservatively 101)
 (setq scroll-up-aggressively 0.01)
 (setq scroll-down-aggressively 0.01)
 (setq scroll-preserve-screen-position 'always)

 ;; 对于高的行禁止自动垂直滚动
 (setq auto-window-vscroll nil)

 ;; 设置新分屏打开的位置的阈值
 (setq split-width-threshold (assoc-default 'width default-frame-alist))
 (setq split-height-threshold nil)

 ;; TAB键设置，在Emacs里不使用TAB键，所有的TAB默认为4个空格
 (setq-default indent-tabs-mode nil)
 (setq-default tab-width 4)

 ;; yes或no提示设置，通过下面这个函数设置当缓冲区名字匹配到预设的字符串时自动回答yes
(setq original-y-or-n-p 'y-or-n-p)
(defalias 'original-y-or-n-p (symbol-function 'y-or-n-p))
(defun default-yes-sometimes (prompt)
  "automatically say y when buffer name match following string"
  (if (or
           (string-match "has a running process" prompt)
           ;; (string-match "does not exist; create" prompt)
           ;; (string-match "modified; kill anyway" prompt)
           ;; (string-match "Delete buffer using" prompt)
           ;; (string-match "Kill buffer of" prompt)
           ;; (string-match "still connected.  Kill it?" prompt)
           ;; (string-match "Shutdown the client's kernel" prompt)
           ;; (string-match "kill them and exit anyway" prompt)
           ;; (string-match "Revert buffer from file" prompt)
           ;; (string-match "Kill Dired buffer of" prompt)
           ;; (string-match "delete buffer using" prompt)
           ;; (string-match "Kill all pass entry" prompt)
           ;; (string-match "for all cursors" prompt)
           ;; (string-match "Do you want edit the entry" prompt)
)
          t
    (original-y-or-n-p prompt)))
(defalias 'yes-or-no-p 'default-yes-sometimes)
(defalias 'y-or-n-p 'default-yes-sometimes)

 ;; 设置剪贴板历史长度300，默认为60
 (setq kill-ring-max 200)

 ;; 在剪贴板里不存储重复内容
 (setq kill-do-not-save-duplicates t)

 ;; 设置位置记录长度为6，默认为16
 ;; 可以使用 `counsel-mark-ring' or `consult-mark' (C-x j) 来访问光标位置记录
 ;; 使用 C-x C-SPC 执行 `pop-global-mark' 直接跳转到上一个全局位置处
 ;; 使用 C-u C-SPC 跳转到本地位置处
 (setq mark-ring-max 6)
 (setq global-mark-ring-max 6)

 ;; 设置 emacs-lisp 的限制
 (setq max-lisp-eval-depth 10000)        ; 默认值为 800
 (setq max-specpdl-size 10000)           ; 默认值为 1600

 ;; 启用 `list-timers', `list-threads' 这两个命令
 (put 'list-timers 'disabled nil)
 (put 'list-threads 'disabled nil)

 ;; 在命令行里支持鼠标
 (xterm-mouse-mode 1)

 ;; 退出Emacs时进行确认
 (setq confirm-kill-emacs 'y-or-n-p)

 ;; 在模式栏上显示当前光标的列号
(defun display-line-numbers-equalize ()
  "Equalize The width"
  (setq display-line-numbers-width (length (number-to-string (line-number-at-pos (point-max))))))
(add-hook 'find-file-hook 'display-line-numbers-equalize)
 (setq column-number-mode t)
  ;; 显示行号 和 文本显示中的截断或省略
  (global-display-line-numbers-mode -1)
  (global-visual-line-mode t)
#+end_src
** 编码设置
#+begin_src emacs-lisp
;; 配置所有的编码为UTF-8，参考：
;; https://thraxys.wordpress.com/2016/01/13/utf-8-in-emacs-everywhere-forever/
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-language-environment 'utf-8)
(set-clipboard-coding-system 'utf-8)
(set-file-name-coding-system 'utf-8)
(set-buffer-file-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(modify-coding-system-alist 'process "*" 'utf-8)
(when (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))

#+end_src

** 彩虹括号
#+begin_src emacs-lisp
    (use-package rainbow-delimiters
      :ensure t
      :hook (prog-mode . rainbow-delimiters-mode))
  (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode)

#+end_src
** line设置
##+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))
##+end_src

** init-ui.el 文件尾
#+BEGIN_SRC emacs-lisp

(provide 'init-ui)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-ui.el ends here
#+END_SRC

*projectile init-completion.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-completion.el :mkdirp yes
:END:
Emacs的补全系统
* init-completion.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-completion.el :mkdirp yes
:END:
** init-completion.el 文件头

#+BEGIN_SRC emacs-lisp
;;; init-completion.el --- Completion settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

#+END_SRC
** yasnippet
#+begin_src emacs-lisp
(use-package yasnippet
  :ensure t
  :config
;;(setq yas-snippet-dirs '("~/.config/emacs/snippets"))
 (yas-global-mode 1)
)
#+end_src

** lsp-bridge 的依赖
#+begin_src emacs-lisp
  (use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown")
  :bind (:map markdown-mode-map
         ("C-c C-e" . markdown-do)))
#+end_src

** lsp-bridge
#+begin_src emacs-lisp
 (use-package lsp-bridge
 :load-path "./site-lisp/lsp-bridge"
 :config

;;(setq acm-backend-copilot-network-proxy '(:host "127.0.0.1" :port 20171))

 ;;   (setq lsp-bridge-enable-log t)
;;    (setq acm-quick-access-use-number-select t)
    (setq lsp-bridge-python-command "/home/apple115/.emacs.d/site-lisp/my-emacs-python/bin/python3.11")
    (setq acm-enable-copilot t)
    (setq acm-candidate-match-function 'orderless-flex)
    ;;(setq lsp-bridge-enable-auto-format-code t);;自动格式化
    (setq lsp-bridge-enable-completion-in-string t)
    (setq lsp-bridge-enable-search-words  t)
    (setq lsp-bridge-multi-lang-server-extension-list '(
    (("jsx") . "typescript_tailwindcss")
    (("html") . "html_tailwindcss")
    ))
    ;;(setq lsp-bridge-enable-org-babel t)
    (setq lsp-bridge-enable-hover-diagnostic t)
    (global-lsp-bridge-mode)
;; (define-key acm-mode-map (kbd "M-1") (lambda () (interactive) (insert "1")))
;; (define-key acm-mode-map (kbd "M-2") (lambda () (interactive) (insert "2")))
;; (define-key acm-mode-map (kbd "M-3") (lambda () (interactive) (insert "3")))
;; (define-key acm-mode-map (kbd "M-4") (lambda () (interactive) (insert "4")))
;; (define-key acm-mode-map (kbd "M-5") (lambda () (interactive) (insert "5")))
;; (define-key acm-mode-map (kbd "M-6") (lambda () (interactive) (insert "6")))
;; (define-key acm-mode-map (kbd "M-7") (lambda () (interactive) (insert "7")))
;; (define-key acm-mode-map (kbd "M-8") (lambda () (interactive) (insert "8")))
;; (define-key acm-mode-map (kbd "M-9") (lambda () (interactive) (insert "9")))
;; (define-key acm-mode-map (kbd "M-0") (lambda () (interactive) (insert "0")))
   (define-key acm-mode-map (kbd "<tab>") 'nil)
)
#+end_src
** init-completion.el 文件尾
#+begin_src emacs-lisp

(provide 'init-completion)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-completion.el ends here

#+end_src

* init-org.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-org.el :mkdirp yes
:END:
org的配置
** init-org.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-org.el --- Org mode settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:


#+END_SRC
** org moderm
#+begin_src emacs-lisp
(use-package org-modern
  :ensure t
  :hook (after-init . (lambda ()
                        (setq org-modern-hide-stars 'leading)
                        (global-org-modern-mode t)))
  :config
  ;; 标题行型号字符
  (setq org-modern-star ["◉" "○" "✸" "✳" "◈" "◇" "✿" "❀" "✜"])
  ;; 额外的行间距，0.1表示10%，1表示1px
  (setq-default line-spacing 0.1)
  ;; tag边框宽度，还可以设置为 `auto' 即自动计算
  (setq org-modern-label-border 1)
  ;; 设置表格竖线宽度，默认为3
  (setq org-modern-table-vertical 2)
  ;; 设置表格横线为0，默认为0.1
  (setq org-modern-table-horizontal 0)
  ;; 复选框美化
  ;; (setq org-modern-checkbox
  ;;       '((?X . #("▢✓" 0 2 (composition ((2)))))
  ;;         (?- . #("▢–" 0 2 (composition ((2)))))
  ;;         (?\s . #("▢" 0 1 (composition ((1)))))))
  ;; 列表符号美化
  (setq org-modern-list
        '((?- . "•")
          (?+ . "◦")
          (?* . "▹")))
  ;; 代码块左边加上一条竖边线（需要Org mode顶头，如果启用了 `visual-fill-column-mode' 会很难看）
  (setq org-modern-block-fringe t)
  ;; 代码块类型美化，我们使用了 `prettify-symbols-mode'
  (setq org-modern-block-name t)
  ;; #+关键字美化，我们使用了 `prettify-symbols-mode'
  (setq org-modern-keyword t)
  )
#+end_src

